#### Terraform Plan 📝`success`

<details><summary>Show Plan</summary>

```terraform
random_id.this: Refreshing state... [id=QVzjSVbnX78]
module.cloudfront.data.aws_route53_zone.main: Reading...
data.aws_caller_identity.current: Reading...
module.vpc.aws_vpc.main: Refreshing state... [id=vpc-00546a76c2314dc2e]
aws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::890742591881:oidc-provider/token.actions.githubusercontent.com]
module.compute.aws_key_pair.main[0]: Refreshing state... [id=rss-key]
module.k3s[0].data.aws_ami.amazon_linux: Reading...
data.aws_region.current: Reading...
aws_s3_bucket.terraform_state: Refreshing state... [id=rss-devops-terraform-state]
module.test_bucket.aws_s3_bucket.this: Refreshing state... [id=test-bucket-415ce34956e75fbf]
module.networking.data.aws_availability_zones.available: Reading...
data.aws_region.current: Read complete after 0s [id=eu-north-1]
module.compute.data.aws_ami.amazon_linux: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=890742591881]
aws_iam_role.github_actions: Refreshing state... [id=GithubActionsRole]
module.cloudfront.data.aws_route53_zone.main: Read complete after 0s [id=Z0934473MSG7NXQ9NQG2]
aws_iam_role_policy_attachment.full_access["arn:aws:iam::aws:policy/AmazonS3FullAccess"]: Refreshing state... [id=GithubActionsRole-20250706062706850400000003]
aws_iam_role_policy_attachment.full_access["arn:aws:iam::aws:policy/CloudFrontFullAccess"]: Refreshing state... [id=GithubActionsRole-20250713030928647400000001]
aws_iam_role_policy_attachment.full_access["arn:aws:iam::aws:policy/AmazonEC2FullAccess"]: Refreshing state... [id=GithubActionsRole-20250706062707059100000006]
module.networking.data.aws_availability_zones.available: Read complete after 0s [id=eu-north-1]
aws_iam_role_policy_attachment.full_access["arn:aws:iam::aws:policy/IAMFullAccess"]: Refreshing state... [id=GithubActionsRole-20250706062707057500000005]
aws_iam_role_policy_attachment.full_access["arn:aws:iam::aws:policy/AmazonRoute53FullAccess"]: Refreshing state... [id=GithubActionsRole-20250706062707303800000007]
aws_iam_role_policy_attachment.full_access["arn:aws:iam::aws:policy/AmazonVPCFullAccess"]: Refreshing state... [id=GithubActionsRole-20250706062706652800000002]
aws_iam_role_policy_attachment.full_access["arn:aws:iam::aws:policy/AmazonSQSFullAccess"]: Refreshing state... [id=GithubActionsRole-20250706062706852400000004]
aws_iam_role_policy_attachment.full_access["arn:aws:iam::aws:policy/AWSCertificateManagerFullAccess"]: Refreshing state... [id=GithubActionsRole-20250713030928659700000002]
aws_iam_role_policy_attachment.full_access["arn:aws:iam::aws:policy/AmazonEventBridgeFullAccess"]: Refreshing state... [id=GithubActionsRole-20250706062706647800000001]
module.compute.data.aws_ami.amazon_linux: Read complete after 1s [id=ami-013ed6046abe69f0f]
module.k3s[0].data.aws_ami.amazon_linux: Read complete after 1s [id=ami-013ed6046abe69f0f]
module.vpc.aws_internet_gateway.main: Refreshing state... [id=igw-0bbb03c7f2fda61e7]
module.networking.aws_subnet.public[1]: Refreshing state... [id=subnet-06fc8c03c010858d8]
module.security.aws_security_group.nat: Refreshing state... [id=sg-0632b05600791eac5]
module.networking.aws_subnet.private[1]: Refreshing state... [id=subnet-06577bf5713420c95]
module.networking.aws_subnet.private[0]: Refreshing state... [id=subnet-0cb46f5589f504ec7]
module.networking.aws_subnet.public[0]: Refreshing state... [id=subnet-015017123a0683162]
module.security.aws_security_group.bastion: Refreshing state... [id=sg-0600585f0e9898d40]
module.security.aws_security_group.public: Refreshing state... [id=sg-0f5980953abceb7ec]
module.networking.aws_route_table.private: Refreshing state... [id=rtb-0aadc012ad98642fd]
module.networking.aws_default_route_table.public: Refreshing state... [id=rtb-07a74d7f91fc46315]
module.security.aws_network_acl.private: Refreshing state... [id=acl-067c7f5d0e9274341]
aws_s3_bucket_server_side_encryption_configuration.state: Refreshing state... [id=rss-devops-terraform-state]
aws_s3_bucket_object_lock_configuration.state: Refreshing state... [id=rss-devops-terraform-state]
aws_s3_bucket_versioning.state: Refreshing state... [id=rss-devops-terraform-state]
module.security.aws_network_acl.public: Refreshing state... [id=acl-002a90dab156fc67e]
module.compute.aws_instance.nat[0]: Refreshing state... [id=i-0e1f558a26eee26fc]
module.test_bucket.aws_s3_bucket_versioning.this: Refreshing state... [id=test-bucket-415ce34956e75fbf]
module.security.aws_security_group.private: Refreshing state... [id=sg-057c072f7c14f67fe]
module.networking.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-09261924d2f47fa0c]
module.security.aws_security_group.k3s: Refreshing state... [id=sg-0a7892eaac5eeb73a]
module.networking.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-02d79f2da919a6ed9]
module.compute.aws_instance.bastion[0]: Refreshing state... [id=i-0c2bb956730076003]
module.k3s[0].aws_instance.k3s_master: Refreshing state... [id=i-0970edcd07503d3f9]
module.networking.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-01297cc9ddc7c186d]
module.networking.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0ac9f795783f184fa]
aws_route.private_nat[0]: Refreshing state... [id=r-rtb-0aadc012ad98642fd1080289494]
module.cloudfront.aws_route53_record.flask_origin[0]: Refreshing state... [id=Z0934473MSG7NXQ9NQG2_flask-origin.sunsundr.store_A]
module.cloudfront.aws_cloudfront_distribution.flask_app[0]: Refreshing state... [id=E2ID46BXEO8LFP]
module.k3s[0].aws_instance.k3s_worker: Refreshing state... [id=i-0a4a66499c87eaf45]
module.cloudfront.aws_route53_record.flask_app[0]: Refreshing state... [id=Z0934473MSG7NXQ9NQG2_flask.sunsundr.store_A]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_route.private_nat[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_route" "private_nat" {
      - destination_cidr_block      = "0.0.0.0/0" -> null
      - id                          = "r-rtb-0aadc012ad98642fd1080289494" -> null
      - instance_id                 = "i-0e1f558a26eee26fc" -> null
      - instance_owner_id           = "890742591881" -> null
      - network_interface_id        = "eni-031f93c66e2ed243f" -> null
      - origin                      = "CreateRoute" -> null
      - route_table_id              = "rtb-0aadc012ad98642fd" -> null
      - state                       = "active" -> null
        # (11 unchanged attributes hidden)
    }

  # module.cloudfront.aws_cloudfront_distribution.flask_app[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_cloudfront_distribution" "flask_app" {
      - aliases                         = [
          - "flask.sunsundr.store",
        ] -> null
      - arn                             = "arn:aws:cloudfront::890742591881:distribution/E2ID46BXEO8LFP" -> null
      - caller_reference                = "terraform-20250713004220377100000001" -> null
      - domain_name                     = "d1kdq31ahkrax6.cloudfront.net" -> null
      - enabled                         = true -> null
      - etag                            = "E1NKPN348LNWLL" -> null
      - hosted_zone_id                  = "Z2FDTNDATAQYW2" -> null
      - http_version                    = "http2" -> null
      - id                              = "E2ID46BXEO8LFP" -> null
      - in_progress_validation_batches  = 0 -> null
      - is_ipv6_enabled                 = false -> null
      - last_modified_time              = "2025-07-13 00:42:21.122 +0000 UTC" -> null
      - price_class                     = "PriceClass_All" -> null
      - retain_on_delete                = false -> null
      - staging                         = false -> null
      - status                          = "Deployed" -> null
      - tags                            = {
          - "Name" = "rss-flask-app-cloudfront"
        } -> null
      - tags_all                        = {
          - "Name" = "rss-flask-app-cloudfront"
        } -> null
      - trusted_key_groups              = [
          - {
              - enabled = false
              - items   = []
            },
        ] -> null
      - trusted_signers                 = [
          - {
              - enabled = false
              - items   = []
            },
        ] -> null
      - wait_for_deployment             = true -> null
        # (3 unchanged attributes hidden)

      - default_cache_behavior {
          - allowed_methods            = [
              - "DELETE",
              - "GET",
              - "HEAD",
              - "OPTIONS",
              - "PATCH",
              - "POST",
              - "PUT",
            ] -> null
          - cached_methods             = [
              - "GET",
              - "HEAD",
            ] -> null
          - compress                   = true -> null
          - default_ttl                = 3600 -> null
          - max_ttl                    = 86400 -> null
          - min_ttl                    = 0 -> null
          - smooth_streaming           = false -> null
          - target_origin_id           = "flask-app-origin" -> null
          - trusted_key_groups         = [] -> null
          - trusted_signers            = [] -> null
          - viewer_protocol_policy     = "redirect-to-https" -> null
            # (5 unchanged attributes hidden)

          - forwarded_values {
              - headers                 = [] -> null
              - query_string            = false -> null
              - query_string_cache_keys = [] -> null

              - cookies {
                  - forward           = "none" -> null
                  - whitelisted_names = [] -> null
                }
            }

          - grpc_config {
              - enabled = false -> null
            }
        }

      - origin {
          - connection_attempts      = 3 -> null
          - connection_timeout       = 10 -> null
          - domain_name              = "flask-origin.sunsundr.store" -> null
          - origin_id                = "flask-app-origin" -> null
            # (2 unchanged attributes hidden)

          - custom_origin_config {
              - http_port                = 8080 -> null
              - https_port               = 443 -> null
              - origin_keepalive_timeout = 5 -> null
              - origin_protocol_policy   = "http-only" -> null
              - origin_read_timeout      = 30 -> null
              - origin_ssl_protocols     = [
                  - "TLSv1.2",
                ] -> null
            }
        }

      - restrictions {
          - geo_restriction {
              - locations        = [] -> null
              - restriction_type = "none" -> null
            }
        }

      - viewer_certificate {
          - acm_certificate_arn            = "arn:aws:acm:us-east-1:890742591881:certificate/44a519cb-e387-4156-95ac-16d5c075ecf1" -> null
          - cloudfront_default_certificate = false -> null
          - minimum_protocol_version       = "TLSv1.2_2021" -> null
          - ssl_support_method             = "sni-only" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.cloudfront.aws_route53_record.flask_app[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_route53_record" "flask_app" {
      - fqdn                             = "flask.sunsundr.store" -> null
      - id                               = "Z0934473MSG7NXQ9NQG2_flask.sunsundr.store_A" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "flask.sunsundr.store" -> null
      - records                          = [] -> null
      - ttl                              = 0 -> null
      - type                             = "A" -> null
      - zone_id                          = "Z0934473MSG7NXQ9NQG2" -> null
        # (2 unchanged attributes hidden)

      - alias {
          - evaluate_target_health = false -> null
          - name                   = "d1kdq31ahkrax6.cloudfront.net" -> null
          - zone_id                = "Z2FDTNDATAQYW2" -> null
        }
    }

  # module.cloudfront.aws_route53_record.flask_origin[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_route53_record" "flask_origin" {
      - fqdn                             = "flask-origin.sunsundr.store" -> null
      - id                               = "Z0934473MSG7NXQ9NQG2_flask-origin.sunsundr.store_A" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "flask-origin.sunsundr.store" -> null
      - records                          = [
          - "13.61.152.163",
        ] -> null
      - ttl                              = 300 -> null
      - type                             = "A" -> null
      - zone_id                          = "Z0934473MSG7NXQ9NQG2" -> null
        # (2 unchanged attributes hidden)
    }

  # module.compute.aws_instance.bastion[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_instance" "bastion" {
      - ami                                  = "ami-0da6daf5e3e5ea2a8" -> null
      - arn                                  = "arn:aws:ec2:eu-north-1:890742591881:instance/i-0c2bb956730076003" -> null
      - associate_public_ip_address          = true -> null
      - availability_zone                    = "eu-north-1a" -> null
      - cpu_core_count                       = 1 -> null
      - cpu_threads_per_core                 = 2 -> null
      - disable_api_stop                     = false -> null
      - disable_api_termination              = false -> null
      - ebs_optimized                        = false -> null
      - get_password_data                    = false -> null
      - hibernation                          = false -> null
      - id                                   = "i-0c2bb956730076003" -> null
      - instance_initiated_shutdown_behavior = "stop" -> null
      - instance_state                       = "running" -> null
      - instance_type                        = "t3.micro" -> null
      - ipv6_address_count                   = 0 -> null
      - ipv6_addresses                       = [] -> null
      - key_name                             = "rss-key" -> null
      - monitoring                           = false -> null
      - placement_partition_number           = 0 -> null
      - primary_network_interface_id         = "eni-0793b964257fdfaf9" -> null
      - private_dns                          = "ip-10-0-1-113.eu-north-1.compute.internal" -> null
      - private_ip                           = "10.0.1.113" -> null
      - public_dns                           = "ec2-13-61-152-163.eu-north-1.compute.amazonaws.com" -> null
      - public_ip                            = "13.61.152.163" -> null
      - secondary_private_ips                = [] -> null
      - security_groups                      = [] -> null
      - source_dest_check                    = true -> null
      - subnet_id                            = "subnet-015017123a0683162" -> null
      - tags                                 = {
          - "Name" = "rss-bastion"
        } -> null
      - tags_all                             = {
          - "Name" = "rss-bastion"
        } -> null
      - tenancy                              = "default" -> null
      - user_data                            = "6652ad36e921a4d8c775ac83e7d5d8c97d855d51" -> null
      - user_data_replace_on_change          = false -> null
      - vpc_security_group_ids               = [
          - "sg-0600585f0e9898d40",
        ] -> null
        # (7 unchanged attributes hidden)

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 2 -> null
            # (1 unchanged attribute hidden)
        }

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_protocol_ipv6          = "disabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "required" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - tags_all              = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0ff06c041aded7c70" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.compute.aws_instance.nat[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_instance" "nat" {
      - ami                                  = "ami-0da6daf5e3e5ea2a8" -> null
      - arn                                  = "arn:aws:ec2:eu-north-1:890742591881:instance/i-0e1f558a26eee26fc" -> null
      - associate_public_ip_address          = true -> null
      - availability_zone                    = "eu-north-1a" -> null
      - cpu_core_count                       = 1 -> null
      - cpu_threads_per_core                 = 2 -> null
      - disable_api_stop                     = false -> null
      - disable_api_termination              = false -> null
      - ebs_optimized                        = false -> null
      - get_password_data                    = false -> null
      - hibernation                          = false -> null
      - id                                   = "i-0e1f558a26eee26fc" -> null
      - instance_initiated_shutdown_behavior = "stop" -> null
      - instance_state                       = "running" -> null
      - instance_type                        = "t3.micro" -> null
      - ipv6_address_count                   = 0 -> null
      - ipv6_addresses                       = [] -> null
      - key_name                             = "rss-key" -> null
      - monitoring                           = false -> null
      - placement_partition_number           = 0 -> null
      - primary_network_interface_id         = "eni-031f93c66e2ed243f" -> null
      - private_dns                          = "ip-10-0-1-32.eu-north-1.compute.internal" -> null
      - private_ip                           = "10.0.1.32" -> null
      - public_dns                           = "ec2-56-228-8-241.eu-north-1.compute.amazonaws.com" -> null
      - public_ip                            = "56.228.8.241" -> null
      - secondary_private_ips                = [] -> null
      - security_groups                      = [] -> null
      - source_dest_check                    = false -> null
      - subnet_id                            = "subnet-015017123a0683162" -> null
      - tags                                 = {
          - "Name" = "rss-nat"
        } -> null
      - tags_all                             = {
          - "Name" = "rss-nat"
        } -> null
      - tenancy                              = "default" -> null
      - user_data                            = "76a5e840060abb12a91ab22dca74449057487126" -> null
      - user_data_replace_on_change          = false -> null
      - vpc_security_group_ids               = [
          - "sg-0632b05600791eac5",
        ] -> null
        # (7 unchanged attributes hidden)

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 2 -> null
            # (1 unchanged attribute hidden)
        }

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_protocol_ipv6          = "disabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "required" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - tags_all              = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-08516f98b6e96039a" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.compute.aws_key_pair.main[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_key_pair" "main" {
      - arn             = "arn:aws:ec2:eu-north-1:890742591881:key-pair/rss-key" -> null
      - fingerprint     = "b5:3e:0c:00:64:d0:1f:bf:3e:24:82:0a:b9:cb:ee:80" -> null
      - id              = "rss-key" -> null
      - key_name        = "rss-key" -> null
      - key_pair_id     = "key-01cae1837aee8f428" -> null
      - key_type        = "rsa" -> null
      - public_key      = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDuuAbOkqKJA/ot8pZGqYC26JDpiLmEhColEn4nxuL1olLsBxJw3TnV63GTOdrhSJRJUWsxwwcT2UwwB50J0D1oySDAMDAqznqct9zECb/dlaD9azF4TxJxh85+OQVuA4MZJoMEk1JWfzP7Y/WGaJk4+Ts9Mj8IWOkowbPUJGZFSi08/6LU6FVJqMRknW9VZLHOqaraKaDTqNZ8Uc6idjOCMuTELPlMSRSdCYZ6Vz1jsXfmK2WredEKHqZF0qn+P7axOgQJGIbNfbrgce+82xc/cTxS2AuqWz3CbVIbKYEGH6s7wkCXycx76w8WLHg7ic/N11oD3LoPfWN5ITF5Te6spLaDBQjv8qBzcwd9RdcadsRy6A/0BeGYMDumUEotfyICDHvY3/0y4oWwaTmn2DkLr5VM/tWG8sh/1jhPARYSuDiy8qp40ZVvpPwv4kPtpRLpkkVmDjV6MlJCvoxVO4/OwuPdYKNzLxCZIQia0g8vEEF4BWLh7zm4Q3pTAz/inhekNTAJsTfP7BICylFACdkwI8gARkUVVp4HSPAbzUjY/ymqp2rB9FvGM/SBPuYBo9BFLCmQZdfFH9z6KeIEjS2ky4do7sQXOKjvZMDe/7ih2b14YmRtq+Hy0YTc3PDyksa3uPIpew7E9JhS+usICiYgvx6t/U1BHbPMPJAwbhT0Bw==" -> null
      - tags            = {} -> null
      - tags_all        = {} -> null
        # (1 unchanged attribute hidden)
    }

  # module.compute.null_resource.setup_keys[0] will be created
  + resource "null_resource" "setup_keys" {
      + id       = (known after apply)
      + triggers = {
          + "keys_dir" = "modules/compute/keys"
        }
    }

  # module.k3s[0].aws_instance.k3s_master must be replaced
-/+ resource "aws_instance" "k3s_master" {
      ~ ami                                  = "ami-0da6daf5e3e5ea2a8" -> "ami-013ed6046abe69f0f" # forces replacement
      ~ arn                                  = "arn:aws:ec2:eu-north-1:890742591881:instance/i-0970edcd07503d3f9" -> (known after apply)
      ~ associate_public_ip_address          = false -> (known after apply)
      ~ availability_zone                    = "eu-north-1a" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 2 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-0970edcd07503d3f9" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ key_name                             = "rss-key" -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-0383a36822385f994" -> (known after apply)
      ~ private_dns                          = "ip-10-0-3-222.eu-north-1.compute.internal" -> (known after apply)
      ~ private_ip                           = "10.0.3.222" -> (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
      + spot_instance_request_id             = (known after apply)
        tags                                 = {
            "Name" = "rss-k3s-master"
            "Role" = "k3s-master"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data_base64                     = (known after apply)
        # (8 unchanged attributes hidden)

      ~ capacity_reservation_specification (known after apply)
      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      ~ cpu_options (known after apply)
      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 2 -> null
            # (1 unchanged attribute hidden)
        }

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      ~ ebs_block_device (known after apply)

      ~ enclave_options (known after apply)
      - enclave_options {
          - enabled = false -> null
        }

      ~ ephemeral_block_device (known after apply)

      ~ instance_market_options (known after apply)

      ~ maintenance_options (known after apply)
      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      ~ metadata_options {
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
            # (4 unchanged attributes hidden)
        }

      ~ network_interface (known after apply)

      ~ private_dns_name_options (known after apply)
      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      ~ root_block_device (known after apply)
      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - tags_all              = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-026ef220eebee4df3" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.k3s[0].aws_instance.k3s_worker must be replaced
-/+ resource "aws_instance" "k3s_worker" {
      ~ ami                                  = "ami-0da6daf5e3e5ea2a8" -> "ami-013ed6046abe69f0f" # forces replacement
      ~ arn                                  = "arn:aws:ec2:eu-north-1:890742591881:instance/i-0a4a66499c87eaf45" -> (known after apply)
      ~ associate_public_ip_address          = false -> (known after apply)
      ~ availability_zone                    = "eu-north-1b" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 2 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-0a4a66499c87eaf45" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ key_name                             = "rss-key" -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-090f16e4d4f51a530" -> (known after apply)
      ~ private_dns                          = "ip-10-0-4-187.eu-north-1.compute.internal" -> (known after apply)
      ~ private_ip                           = "10.0.4.187" -> (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
      + spot_instance_request_id             = (known after apply)
        tags                                 = {
            "Name" = "rss-k3s-worker"
            "Role" = "k3s-worker"
        }
      ~ tenancy                              = "default" -> (known after apply)
      ~ user_data                            = "4b6adf8c367d87e6126be803c99809cd0b33a8bf" -> (known after apply)
      + user_data_base64                     = (known after apply)
        # (7 unchanged attributes hidden)

      ~ capacity_reservation_specification (known after apply)
      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      ~ cpu_options (known after apply)
      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 2 -> null
            # (1 unchanged attribute hidden)
        }

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      ~ ebs_block_device (known after apply)

      ~ enclave_options (known after apply)
      - enclave_options {
          - enabled = false -> null
        }

      ~ ephemeral_block_device (known after apply)

      ~ instance_market_options (known after apply)

      ~ maintenance_options (known after apply)
      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      ~ metadata_options {
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
            # (4 unchanged attributes hidden)
        }

      ~ network_interface (known after apply)

      ~ private_dns_name_options (known after apply)
      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      ~ root_block_device (known after apply)
      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - tags_all              = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0d4dbe5dc2a0b12d1" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
            # (1 unchanged attribute hidden)
        }
    }

Plan: 3 to add, 0 to change, 9 to destroy.

Changes to Outputs:
  - bastion_public_ip       = "13.61.152.163" -> null
  - flask_app_url           = "https://flask.sunsundr.store" -> null
  ~ k3s_master_ip           = "10.0.3.222" -> (known after apply)
  ~ k3s_worker_ip           = "10.0.4.187" -> (known after apply)
  - nat_public_ip           = "56.228.8.241" -> null

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>